{
  "translation": {
    "general": {
      "goBack": "Go back",
      "altPhoto": "Henrique's photo",
      "themeChanger": {
        "btnAria": "Button to change the portfolio language.",
        "fingerPointerTitle": "Clickable finger that changes the language."
      },
      "arrowToBeginning": "Arrow to return to the beginning",
      "challenges": "Challenges",
      "flags": {
        "brazilFlagAlt": "Image of the Brazil flag",
        "UnitedStatesFlagAlt": "Image of the United States flag"
      },
      "header": {
        "about": "About",
        "technologies": "Technologies",
        "projects": "Projects",
        "achievements": "Achievements",
        "experiences": "Experiences",
        "contact": "Contact",
        "hamburguerAlt": "Button that expands the navigation bar"
      },
      "footer": {
        "madeBy": "Made by Henrique Albuquerque Mascarin"
      }
    },
    "mainPage": {
      "nameSection": {
        "developer": "Mobile and Front-end Developer",
        "arrowDown": "Arrow to go to the section below"
      },
      "aboutSection": {
        "title": "About",
        "aboutList": [
          "Mid-level Front-end developer, specialized in React.js and Vue.js. I transform forgotten, ugly, or confusing interfaces into striking visual experiences. Increased the flexibility for SG Master Web by 100%, with permissions control and tax configuration of merchant acquirers. Optimized production deployments and build testing by 80% through CI/CD automation for the Media Timer app. With this background, I seek to generate impact in mobile development with React Native."
        ],
        "curriculum": "Curriculum"
      },
      "technologiesSection": {
        "title": "Technologies"
      },
      "projectsSection": {
        "title": "Projects",
        "policy": "Privacy policy",
        "completed": "Completed",
        "underDevelopment": "Under development",
        "seeTheWebSite": "See the website",
        "downloadTheApp": "Download the app",
        "projects": {
          "StarTShirts": {
            "title": "Star T-Shirts",
            "about": "A fictional e-commerce app, built to showcase expertise in modern mobile technologies.",
            "challengesList": [
              "I noticed on the product preview page, with the option to view the shirt in 3D, and, as an added bonus, it changes the color if you have selected another one.",
              "I didn't depend on third-party libraries, with a native Kotlin module to show the splash screen when it finishes initializing the entire application with its complete data.",
              "To make it practical to test the registration, login, and password recovery flows, I ended up automating them with integrated automated tests using Jest and React Native Testing Library.",
              "I've increased user clarity by implementing custom situational alerts that indicate the outcome of requests to the fictional backend.",
              "I made the application look like a real project by developing a fictitious back end with Async Storage."
            ]
          },
          "MediaTimer": {
            "title": "Media Timer",
            "about": "Timer app with sounds from your device, published on Google Play.",
            "challengesList": [
              "Solved a user's problem and left him 100% satisfied by implementing infinite scrolling of the numbers in the timer list, being able to scroll up and down infinitely.",
              "Optimized production deployments and build testing by 80% through CI/CD automation (GitHub Actions and EAS Expo) for the Media Timer app.",
              "Added a differentiator for users by implementing the ability to select sounds from your cell phone and see the most recent ones in a history in the app.",
              "Increased availability for users in other countries by 100% with the implementation of English/US and Portuguese/BR languages with a Context API that uses i18next.",
              "I've pleased many users by making it possible to switch themes to dark or white, with a Context API to manage that state.",
              "Improved the app's versatility, with the timer running in the background, and, if you remove the app's notification, it turns off the timer.",
              "Resolved the Google Play requirements by updating the Expo and React Native versions to the latest. After this, I fixed library incompatibility issues.",
              "I was able to bring more security to users by creating the Media Timer app's privacy policy.",
              "To prevent copying, I have created a copyright license for the Media Timer app."
            ]
          },
          "BobsCarDealer": {
            "title": "Bob’s Car Dealer",
            "about": "Website for researching car models, developed for a technical test of a vacancy.",
            "challengesList": [
              "I had to learn about Next.js in 1 day.",
              "The base of the project was done in 1 day and, in the other 3 days, I made some improvements.",
              "I had to learn about dynamic routes of Next.js, but unfortunately, I don't have implemented adequately the static params.",
              "Use the Next.js loading file, and React Suspense (which unfortunately I didn't implement properly).",
              "Learn about .env.local.",
              "Configure Prettier and ESLint."
            ]
          },
          "Ebooks": {
            "title": "E-books",
            "about": "Book research website, which was used for the selection process test that made me to being hired at SGBr® Sistemas.",
            "challengesList": [
              "I developed the project in 1 week and a few days.",
              "Had to learn the technologies: Vue, Pinia and Tailwind in the same time.",
              "Used Pinia for global state.",
              "Data treatment and validations when searching for the book in case of error or success.",
              "I used the Google API to search for books.",
              "Accessibility test.",
              "Favorites by local storage.",
              "Each book can be favorite or removed by the button on the card, both in the favorite tab and on the main page.",
              "Card images can be clicked to display them in a larger size.",
              "Responsive website, can be used on mobile and computer.",
              "Text treatment of the cards of books."
            ]
          },
          "Portfolio": {
            "title": "Portfolio",
            "about": "My personal page, which is the showcase of my career, was developed and still receives updates to provide security for those who want to hire me.",
            "challengesList": [
              "Responsive website, can be used on mobile and computer.",
              "Accessibility test.",
              "Header links are indicated by a color change, depending on the section you are.",
              "Achievements section functionality, where you click on an achievement, and it opens one way on computer and another on mobile, also allowing you to see the image of the achievement in a larger size and the more details button.",
              "Privacy policy page about the Media Timer app.",
              "All texts are designed to tell about my experience and provide security to the client or recruiter.",
              "Website in English/US and Portuguese/BR (depends on your device language) with i18next.",
              "After clicking on the LinkedIn button in the contact section, it ends up taking you to the “Thank You” screen that redirects to LinkedIn."
            ]
          },
          "GodOfWar": {
            "title": "God Of War E-commerce",
            "about": "Fictional e-commerce project themed around the game God of War: Ragnarök.",
            "challengesList": [
              "Carousel of items without a library, developed from scratch and responsive.",
              "Responsive website, can be used on mobile and computer.",
              "Cart and products by local storage.",
              "Accessibility test.",
              "Fictitious cart screen with the products you chose.",
              "Header hides when scrolling down and expands when scrolling up.",
              "Using React's Context for global state."
            ]
          }
        }
      },
      "achievementsSection": {
        "title": "Achievements",
        "buttonToCloseAlt": "Button to close the modal",
        "cardExpandClickAria": "Click to expand or collapse the card below",
        "fingerToExpand": "Clickable finger that expands the “about” of that achievement",
        "clickToZoomAria": "Click to open the image in full screen",
        "fingerToZoom": "Clickable finger that opens the image in full screen",
        "moreDetails": "More details",
        "achievements": {
          "RSTIFrontEnd": {
            "title": "RSTI Front-end Trail",
            "about": "Senac's in-person course that helped to improve design concepts, HTML semantics and CSS styling.",
            "imageAlt": "Image of the Senac RSTI front-end trail certificate."
          },
          "StartupWeekend": {
            "title": "Startup Weekend Smart Cities - Santo Ângelo/RS (2022)",
            "about": "I worked as a designer for the “O Campo” app, winner of this edition.",
            "imageAlt": "Image with the Smart Cities first place trophy."
          },
          "RSTIProgrammingLogic": {
            "title": "RSTI Programming Logic Trail",
            "about": "In-person course held at Senac, where I faced challenges on paper and on the computer. As a result, I improved my logic with programming.",
            "imageAlt": "Image of the Senac RSTI programming logic trail certificate."
          },
          "UdemyWebDesign": {
            "title": "Udemy Web Design Course",
            "about": "I learned how to develop websites using HTML, CSS3, and JavaScript. With a special touch of semantics, accessibility and programming logic.",
            "imageAlt": "Image of the Udemy Web Design course certificate"
          },
          "UdemyProgrammingLogic": {
            "title": "Udemy Algorithms and Programming Logic Course",
            "about": "In this course, has presented the base of programming logic, with exercises about different programming languages and explanations about the subject.",
            "imageAlt": "Image of the Udemy Algorithms and Programming Logic course certificate"
          }
        }
      },
      "experiencesSection": {
        "title": "Experiences",
        "experiencesList": {
          "SGBrSistemas": {
            "position": "Front-end Developer",
            "timeCompany": "July/2023 - Present",
            "about": "I work on the development of the SG Master Web system, a business management platform with thousands of active clients.",
            "challengesList": [
              "Optimized user management across the SG Master Web system by implementing table-based permission control, enabling specific role assignments, and eliminating the risk of unauthorized access. For example, one user may have permission to register a sale, while another may not.",
              "Made it 100% easier to set up fees for each acquirer, allowing you to register fees by each acquirer's brand. I then refactored the sales flow to select these acquirers. After paying for the sale, the installments are recorded in the finance department on the card reconciliation page, allowing you to cancel, reconcile, and view the installment.",
              "Achieved 100% approval from product managers regarding the front-end design of the SG Master Web system. I sought to customize the design of Quasar's pre-built components using CSS and used the DevTools inspector to identify which classes needed to be modified, making the design different from the framework's default.",
              "I've left my customers satisfied after implementing email sending for invoices. I added a new email sending settings block to each sales module, where you can configure SMTP sending data, automated sending on issue, and the footer from a WYSIWYG editor.",
              "Saved time and effort on new implementations, being able to streamline many of the new workflows by creating sketches in Figma that aligned the ideas of the people responsible.",
              "Drew customers attention to the SG Master Web system by creating a landing page containing all the necessary information, such as plans, services, management, and registration of their companies.",
              "Reviewing practical tests for new talent, providing code review, and helping others when they need it."
            ]
          },
          "HenriqueMascarin": {
            "position": "Founder and Mobile Developer",
            "timeCompany": "April/2023 - Present",
            "about": "I am the founder and developer of the Media Timer app, a timer with sounds from your device, published on Google Play.",
            "challengesList": [
              "Solved a user's problem and left him 100% satisfied by implementing infinite scrolling of the numbers in the timer list, being able to scroll up and down infinitely.",
              "Optimized production deployments and build testing by 80% through CI/CD automation (GitHub Actions and EAS Expo) for the Media Timer app.",
              "Added a differentiator for users by implementing the ability to select sounds from your cell phone and see the most recent ones in a history in the app.",
              "Internationalized the Media Timer app, implementing English/US and Portuguese/BR languages with a Context API that uses i18next.",
              "I've pleased many users by making it possible to switch themes to dark or white, with a Context API to manage that state.",
              "Improved the app's versatility, with the timer running in the background, and, if you remove the app's notification, it turns off the timer.",
              "Resolved the Google Play requirements by updating the Expo and React Native versions to the latest. After this, I fixed library incompatibility issues.",
              "Was able to bring more security to users by creating the Media Timer app's privacy policy.",
              "To prevent copying, I have created a copyright license for the Media Timer app.",
              "To attract attention, I marketed the apps on the company's LinkedIn."
            ]
          }
        }
      },
      "contactSection": {
        "title": "Contact",
        "thanksMessage": "Thank you for visiting my portfolio!",
        "connectMessage": "Feel free to connect and send a message via"
      }
    },
    "thanksPage": {
      "title": "Many thanks!",
      "replyText": "I will answer you as soon as possible.",
      "caseOfRedirect": "If you are not redirected",
      "clickHere": "click here!"
    },
    "policyMediaTimer": {
      "title": "Privacy Policy",
      "welcome": {
        "title": "Welcome to Media Timer, an app for android!",
        "subtitle": "This is a timer app developed by Henrique de Albuquerque Mascarin and has the objective to solve a personal problem."
      },
      "dataCollected": {
        "title": "Data collected by the App",
        "declaration": "No data is collected. Everything provided like file data, audio history, and theme settings are all kept inside the app.",
        "permissionsParagraph": "The list of permissions listed below are found here on the"
      },
      "permissionsList": {
        "permission": "Permission",
        "necessary": "Why is it necessary",
        "reasons": {
          "adReason": "Used to display the bottom ad on the main screen.",
          "storageReason": "Used to read audios that the person selects from their device or that are saved in the history.",
          "notificationsReason": "Used to show application notifications when the timer is running.",
          "historyArchiveReason": "Used to find the location of the file selected in the tab of history.",
          "configureAudioReason": "Used with EXPO AV technology, to configure the audios used in the app."
        },
        "contact": "If you see some permissions that are not listed here or have any security questions, feel free to send a message to the email:"
      }
    }
  }
}
