{
  "translation": {
    "general": {
      "goBack": "Voltar",
      "altPhoto": "Foto do Henrique",
      "themeChanger": {
        "btnAria": "Botão para trocar o idioma do portfólio.",
        "fingerPointerTitle": "Dedo clicável que troca o idioma."
      },
      "arrowToBeginning": "Seta para retornar ao início",
      "challenges": "Desafios",
      "flags": {
        "brazilFlagAlt": "Imagem da bandeira do Brasil",
        "UnitedStatesFlagAlt": "Imagem da bandeira dos Estados Unidos"
      },
      "header": {
        "about": "Sobre",
        "technologies": "Tecnologias",
        "projects": "Projetos",
        "achievements": "Conquistas",
        "experiences": "Experiências",
        "contact": "Contato",
        "hamburguerAlt": "Botão que expande a barra de navegação"
      },
      "footer": {
        "madeBy": "Feito por Henrique de Albuquerque Mascarin"
      }
    },
    "mainPage": {
      "nameSection": {
        "developer": "Desenvolvedor Mobile e Front-end",
        "arrowDown": "Seta para ir na seção abaixo"
      },
      "aboutSection": {
        "title": "Sobre",
        "aboutList": [
          "Desenvolvedor com mais de 3 anos de experiência na programação, tendo sua trajetória iniciada em Front-end e atualmente focada em desenvolvimento mobile com React Native. Sou fundador da minha empresa, publiquei o aplicativo Media Timer na Google Play e estou desenvolvendo o aplicativo fictício de e-commerce Star T-Shirts como projeto de apresentação.",
          "Minha base sólida em Front-end contribui diretamente para a qualidade dos meus projetos mobile, aplicando boas práticas de acessibilidade, código limpo e design UX/UI. Como destaque, atualmente atuo no sistema SG Master Web, utilizado por milhares de clientes.",
          "Tenho experiência sólida com React.js, principal tecnologia dos meus sites que seguem boas práticas de HTML semântico. Por fim, possuo conhecimento em Next.js e tecnologias de estilização como Sass, Styled Components e Tailwind CSS."
        ],
        "curriculum": "Currículo"
      },
      "technologiesSection": {
        "title": "Tecnologias"
      },
      "projectsSection": {
        "title": "Projetos",
        "policy": "Política de privacidade",
        "completed": "Concluído",
        "underDevelopment": "Em desenvolvimento",
        "seeTheWebSite": "Veja o site",
        "downloadTheApp": "Baixe o aplicativo",
        "projects": {
          "StarTShirts": {
            "title": "Star T-Shirts",
            "about": "Aplicativo fictício de e-commerce, exclusivo para camisetas.",
            "challengesList": [
              "Chamei atenção na página de visualização de produto, com a opção de visualizar a camiseta em 3D e, como um adicional, ela muda a cor caso você tenha selecionado outra.",
              "Não dependi de bibliotecas terceiras, com um módulo nativo em Kotlin para mostrar a tela inicial quando termina de inicializar todo o aplicativo com seus dados completos.",
              "Para ser prático de testar os fluxos de cadastro, login e recuperação de senha, acabei automatizando com testes automatizados integrados utilizando Jest e React Native Testing Library.",
              "Aumentei a clareza para o usuário, ao implementar alertas situacionais personalizados, que indicam o resultado das requisições ao back-end fictício.",
              "Deixei o aplicativo parecido com um projeto real, ao desenvolver um back-end fictício com Async Storage."
            ]
          },
          "MediaTimer": {
            "title": "Media Timer",
            "about": "Aplicativo temporizador com sons do seu dispositivo, publicado na Google Play.",
            "challengesList": [
              "Resolvi o problema de um usuário e deixei-o satisfeito em 100%, ao implementar a rolagem infinita dos números na lista do temporizador, podendo rolar para cima e para baixo infinitamente.",
              "Deixei os envios para a produção e testes de build 100% mais rápidos, ao implementar automações com CI/CD (GitHub Actions e EAS Expo) que acionam quando se envia uma release ou commit na branch main.",
              "Adicionei um diferencial aos usuários, ao implementar a possibilidade de selecionar sons do seu celular e ver os mais recentes em um histórico no aplicativo.",
              "Aumentei a disponibilidade para usuários de outros países em 100%, com a implementação de idiomas em inglês/US e português/BR com Context API que utiliza i18next.",
              "Agradei diferentes usuários ao possibilitar a troca de temas para escuro ou branco, com uma Context API para gerenciar esse estado.",
              "Melhorei a versatilidade do aplicativo, com o funcionamento do temporizador em segundo plano e, caso remova a notificação do aplicativo, ele desliga o temporizador.",
              "Resolvi os requisitos da Google Play, ao atualizar a versão do Expo e React Native para a mais nova. Após isso, corrigi problemas de incompatibilidades com bibliotecas.",
              "Consegui trazer mais segurança aos usuários ao criar a política de privacidade do aplicativo Media Timer.",
              "Para evitar cópias, criei uma licença de copyright para o aplicativo Media Timer."
            ]
          },
          "BobsCarDealer": {
            "title": "Bob’s Car Dealer",
            "about": "Site para pesquisa sobre modelos de carros, desenvolvido para o teste técnico de uma vaga.",
            "challengesList": [
              "Tive que aprender sobre Next.js em 1 dia.",
              "A base do projeto foi feita em 1 dia e, nos outros 3 dias, fiz algumas melhorias.",
              "Aprender sobre rotas dinâmicas do Next.js, só que infelizmente não implementei adequadamente o static params.",
              "Utilizar o arquivo de loading do Next.js, e o React Suspense (que infelizmente não implementei corretamente).",
              "Aprender sobre .env.local.",
              "Configurar Prettier e ESLint."
            ]
          },
          "Ebooks": {
            "title": "E-books",
            "about": "Site de pesquisa de livros, que foi para o teste do processo seletivo que acabei sendo contratado na SGBr® Sistemas.",
            "challengesList": [
              "Desenvolvi o projeto em 1 semana e alguns dias.",
              "Aprender as tecnologias: Vue, Pinia e Tailwind nesse mesmo tempo.",
              "Utilizado Pinia para o estado global.",
              "Tratamento de dados e validações quando for pesquisar o livro no caso de erro ou sucesso.",
              "Utilizei a API do Google para a pesquisa dos livros.",
              "Testei acessibilidade.",
              "Favoritos por local storage.",
              "Cada livro pode ser favorito ou removido pelo botão no cartão, tanto na aba de favorito e página principal.",
              "Imagens dos cartões podem ser clicadas e assim mostrando ela em tamanho maior.",
              "Site responsivo, pode ser usado em dispositivos móveis e computadores.",
              "Tratamento de textos dos cartões dos livros."
            ]
          },
          "Portfolio": {
            "title": "Portfólio",
            "about": "Minha página pessoal, onde é a vitrine sobre minha carreira, foi desenvolvida e ainda recebe atualizações para transmitir segurança para quem quer me contratar.",
            "challengesList": [
              "Site responsivo, pode ser usado em dispositivos móveis e computadores.",
              "Testei acessibilidade.",
              "Links do cabeçalho são indicados por uma troca de cor, conforme a seção em que você está situado.",
              "Funcionalidade da seção de conquistas, onde você clica em uma conquista e abre de um jeito no computador e outro no celular, também podendo ver a imagem da conquista em tamanho maior e o botão de mais detalhes.",
              "Página da política de privacidade sobre o aplicativo Media Timer.",
              "Todos os textos são pensados para contar sobre a minha experiência e trazer uma segurança ao cliente ou recrutador.",
              "Site em inglês/US e português/BR (depende do idioma do seu dispositivo) com i18next.",
              "Após clicar no botão do LinkedIn na seção de contato, acaba levando para a tela de “obrigado” que redireciona para o LinkedIn."
            ]
          },
          "GodOfWar": {
            "title": "God Of War E-commerce",
            "about": "Projeto fictício de e-commerce com a temática do jogo God of War: Ragnarök.",
            "challengesList": [
              "Carrossel de itens sem biblioteca, desenvolvido do zero e responsivo.",
              "Site responsivo, pode ser usado em dispositivos móveis e computadores.",
              "Carrinho e produtos por local storage.",
              "Testei acessibilidade.",
              "Tela fictícia de carrinho com os produtos que você escolheu.",
              "Cabeçalho se esconde rolando para baixo e rolando para cima se expande.",
              "Usando Context do React para o estado global."
            ]
          }
        }
      },
      "achievementsSection": {
        "title": "Conquistas",
        "buttonToCloseAlt": "Botão de fechar o modal",
        "cardExpandClickAria": "Clique para expandir ou fechar o cartão abaixo",
        "fingerToExpand": "Dedo clicável que expande o “sobre” da conquista",
        "clickToZoomAria": "Clique para abrir a imagem em tela cheia",
        "fingerToZoom": "Dedo clicável que abre a imagem em tela cheia",
        "moreDetails": "Mais detalhes",
        "achievements": {
          "RSTIFrontEnd": {
            "title": "Trilha Front-end RSTI",
            "about": "Curso presencial do Senac que ajudou a aperfeiçoar os conceitos de design, semântica de HTML e estilização CSS.",
            "imageAlt": "Imagem do certificado da trilha front-end RSTI do Senac."
          },
          "StartupWeekend": {
            "title": "Startup Weekend Smart Cities - Santo Ângelo/RS (2022)",
            "about": "Atuei como designer do aplicativo “O Campo”, vencedor dessa edição.",
            "imageAlt": "Imagem com o troféu de primeiro lugar do Smart Cities."
          },
          "RSTIProgrammingLogic": {
            "title": "Trilha Lógica de Programação RSTI",
            "about": "Curso presencial realizado no Senac, em que enfrentei desafios no papel e no computador. Como resultado, aperfeiçoei minha lógica com a programação.",
            "imageAlt": "Imagem do certificado da trilha lógica de programação RSTI do Senac"
          },
          "UdemyWebDesign": {
            "title": "Curso Web Design Udemy",
            "about": "Aprendi a desenvolver sites utilizando HTML, CSS3 e JavaScript. Com um toque especial de semântica, acessibilidade e lógica de programação.",
            "imageAlt": "Imagem do certificado do curso de Web Design da Udemy"
          },
          "UdemyProgrammingLogic": {
            "title": "Curso Algoritmos e Lógica de Programação Udemy",
            "about": "Nesse curso, foi apresentado sobre a base da lógica de programação, tendo exercícios com diferentes linguagens de programação e explicações sobre o assunto.",
            "imageAlt": "Imagem do certificado do curso algoritmos e lógica de programação da Udemy"
          }
        }
      },
      "experiencesSection": {
        "title": "Experiências",
        "experiencesList": {
          "SGBrSistemas": {
            "position": "Desenvolvedor Front-end",
            "timeCompany": "Julho/2023 - Presente",
            "about": "Atuo no desenvolvimento do sistema SG Master Web, plataforma de gestão empresarial com milhares de clientes ativos.",
            "challengesList": [
              "Otimizei o gerenciamento de usuários em 100% do sistema SG Master Web, implementando controle de permissões por tabela, o que viabilizou atribuições específicas por função e eliminou riscos de acesso indevido. Exemplo: um usuário pode ter permissão para cadastrar uma venda, enquanto outro não.",
              "Facilitei a configuração de taxas por credenciadoras em 100%, com a possibilidade de cadastrar as taxas pelas bandeiras das credenciadoras. Em seguida, refatorei o fluxo de vendas para escolher essas credenciadoras e, após pagar a venda, as parcelas são registradas no financeiro na página de conciliação de cartão, sendo assim, podendo cancelar, conciliar e visualizar a parcela.",
              "Consegui aprovação de 100% dos responsáveis pelo produto em relação ao design de Front-end do sistema SG Master Web. Busquei customizar o design dos componentes já prontos do Quasar por CSS e utilizei o inspecionador do DevTools para saber as classes que deveriam ser modificadas, deixando o design diferente do padrão do framework.",
              "Deixei os clientes satisfeitos após implementar o envio de e-mail em relação às notas fiscais. Adicionei um bloco novo de configurações para envio de e-mail em cada módulo de venda, onde podem ser configurados os dados de envio SMTP, a automação de envio ao emitir e o rodapé a partir de um editor WYSIWYG.",
              "Poupei tempo e esforço nas novas implementações, conseguindo agilizar boa parte dos fluxos novos ao criar esboços no Figma com alinhamentos das ideias do pessoal responsável.",
              "Chamei a atenção dos clientes para o sistema SG Master Web, com a criação da landing page contendo todas as informações necessárias como planos, serviços, gerenciamento e cadastro das suas empresas.",
              "Revisão sobre testes práticos de novos talentos, code review e auxílio aos outros quando necessitam."
            ]
          },
          "HenriqueMascarin": {
            "position": "Fundador e Desenvolvedor Mobile",
            "timeCompany": "Abril/2023 - Presente",
            "about": "Atuo como fundador e desenvolvedor do aplicativo Media Timer, temporizador com sons do seu dispositivo, publicado na Google Play.",
            "challengesList": [
              "Resolvi o problema de um usuário e deixei-o satisfeito em 100%, ao implementar a rolagem infinita dos números na lista do temporizador, podendo rolar para cima e para baixo infinitamente.",
              "Deixei os envios para a produção e testes de build 100% mais rápidos, ao implementar automações com CI/CD (GitHub Actions e EAS Expo) que acionam quando se envia uma release ou commit na branch main.",
              "Adicionei um diferencial aos usuários, ao implementar a possibilidade de selecionar sons do seu celular e ver os mais recentes em um histórico no aplicativo.",
              "Aumentei a disponibilidade para usuários de outros países em 100%, com a implementação de idiomas em inglês/US e português/BR com Context API que utiliza i18next.",
              "Agradei diferentes usuários ao possibilitar a troca de temas para escuro ou branco, com uma Context API para gerenciar esse estado.",
              "Melhorei a versatilidade do aplicativo, com o funcionamento do temporizador em segundo plano e, caso remova a notificação do aplicativo, ele desliga o temporizador.",
              "Resolvi os requisitos da Google Play, ao atualizar a versão do Expo e React Native para a mais nova. Após isso, corrigi problemas de incompatibilidades com bibliotecas.",
              "Consegui trazer mais segurança aos usuários ao criar a política de privacidade do aplicativo Media Timer.",
              "Para evitar cópias, criei uma licença de copyright para o aplicativo Media Timer.",
              "Visando chamar a atenção, fiz o marketing sobre os aplicativos no LinkedIn da empresa."
            ]
          }
        }
      },
      "contactSection": {
        "title": "Contato",
        "thanksMessage": "Obrigado por visitar meu portfólio!",
        "connectMessage": "Se sinta à vontade para se conectar e enviar uma mensagem pelo"
      }
    },
    "thanksPage": {
      "title": "Muito obrigado!",
      "replyText": "Lhe responderei quanto antes.",
      "caseOfRedirect": "Caso não seja redirecionado",
      "clickHere": "clique aqui!"
    },
    "policyMediaTimer": {
      "title": "Política de Privacidade",
      "welcome": {
        "title": "Bem vindo ao Media Timer, um aplicativo para android!",
        "subtitle": "Esse é um aplicativo temporizador desenvolvido por Henrique de Albuquerque Mascarin e visa resolver um problema pessoal."
      },
      "dataCollected": {
        "title": "Dados coletados pelo aplicativo",
        "declaration": "Nenhum dado é coletado. Tudo fornecido como dados de arquivos, histórico de áudios e configurações de tema são todos mantidos no aplicativo.",
        "permissionsParagraph": "A lista de permissões listadas abaixo são encontradas aqui no"
      },
      "permissionsList": {
        "permission": "Permissão",
        "necessary": "Porque é necessária",
        "reasons": {
          "adReason": "Utilizados para mostrar o anúncio de baixo na tela principal.",
          "storageReason": "Utilizados para ler áudios que a pessoa seleciona do seu dispositivo ou que estão salvos no histórico.",
          "notificationsReason": "Utilizado para mostrar as notificações do aplicativo, quando está executando o temporizador.",
          "historyArchiveReason": "Utilizado para encontrar o local do arquivo selecionado na aba de histórico.",
          "configureAudioReason": "Utilizado com a tecnologia EXPO AV, para configurar os áudios usados no aplicativo."
        },
        "contact": "Caso tenha visto alguma permissão que não esteja listada aqui ou sobre qualquer dúvida de segurança, se sinta livre em mandar uma mensagem ao e-mail:"
      }
    }
  }
}
