{
  "translation": {
    "general": {
      "goBack": "Voltar",
      "altPhoto": "Foto do Henrique",
      "themeChangerBtnAria": "Botão para trocar o idioma do portfólio.",
      "arrowToBeginning": "Seta para retornar ao início",
      "challenges": "Desafios",
      "flags": {
        "brazilFlagAlt": "Imagem da bandeira do Brasil",
        "UnitedStatesFlagAlt": "Imagem da bandeira dos Estados Unidos"
      },
      "header": {
        "about": "Sobre",
        "technologies": "Tecnologias",
        "projects": "Projetos",
        "achievements": "Conquistas",
        "experiences": "Experiências",
        "contact": "Contato",
        "hamburguerAlt": "Botão que expande a barra de navegação"
      },
      "footer": {
        "madeBy": "Feito por Henrique de Albuquerque Mascarin"
      }
    },
    "mainPage": {
      "nameSection": {
        "mobileDeveloper": "Desenvolvedor Mobile",
        "arrowDown": "Seta para ir na seção abaixo"
      },
      "aboutSection": {
        "title": "Sobre",
        "mobileParagraph": "Desenvolvedor há mais de 2 anos. Como desenvolvedor mobile, me dediquei a desenvolver minha própria empresa na Google Play do zero até a publicação do aplicativo Media Timer. Agora, busco construir outros projetos para ter mais experiência, como o novo aplicativo em desenvolvimento Star T-Shirts. Assim, visando conseguir uma nova oportunidade no mercado de aplicativos utilizando React Native.",
        "frontEndParagraph": "Como desenvolvedor front-end, trabalho atualmente em um projeto com centenas de clientes, o sistema SG Master Web, onde eu e minha equipe de front-end desenvolvemos o projeto do zero, enfrentando diversos desafios. Também possuo projetos pessoais, onde sempre busquei me desafiar para aprender algo novo.",
        "aboutMeParagraph": "Por fim, sou uma pessoa determinada e tenho como objetivo melhorar constantemente. Não gosto de brigas e tento sempre ser amigável. Procuro, assim, aprender com os outros e auxiliar o possível.",
        "curriculum": "Currículo"
      },
      "technologiesSection": {
        "title": "Tecnologias"
      },
      "projectsSection": {
        "title": "Projetos",
        "policy": "Política de privacidade",
        "completed": "Concluído",
        "underDevelopment": "Em desenvolvimento",
        "seeTheWebSite": "Veja o site",
        "downloadTheApp": "Baixe o aplicativo",
        "projects": {
          "StarTShirts": {
            "title": "Star T-Shirts",
            "about": "Aplicativo fictício de e-commerce, somente de camisetas.",
            "challengesList": [
              "Design único no Figma.",
              "Primeiro projeto sem Expo, somente React Native CLI.",
              "Módulo nativo para mostrar a Splash Screen, escrito com Kotlin.",
              "React Navigation para rotas.",
              "Estrutura do projeto foi pensada como se fosse um produto real.",
              "Telas de formulário com React Hook Form, com suas validações do Zod.",
              "Componentização de elementos muito utilizados.",
              "Alertas situacionais desenvolvidos do zero, gerados por meio de estado global."
            ]
          },
          "MediaTimer": {
            "title": "Media Timer",
            "about": "Aplicativo de temporizador, teve como objetivo solucionar um problema pessoal.",
            "challengesList": {
              "development": "Projeto com mais de 1 ano de desenvolvimento.",
              "publishing": "Publicação na Google Play em produção.",
              "licenseAndTerms": "Licença para o projeto e termos de privacidade.",
              "sounds": "Poder escolher sons do celular ou do aplicativo e histórico de sons do celular.",
              "marketing": "Marketing sobre o projeto no LinkedIn da empresa.",
              "languages": "Aplicativo em inglês/US e português/BR (depende do idioma do seu dispositivo) com i18next.",
              "themes": "Tema escuro e branco, criei um Context do React para gerenciar esse estado.",
              "notAllowedThemeChanges": "Pelo código nativo, não permiti celulares (exemplo Xiaomi) trocarem as cores dos temas por outras.",
              "globalState": "Estados globais pelo Redux.",
              "background": "Funciona em segundo plano.",
              "permissions": "Permissões do dispositivo.",
              "accessibility": "Testei a acessibilidade e fiz com que não seja possível mudar o tamanho dos textos pelo celular do usuário.",
              "timerLogic": "A lógica do temporizador foi complexa de desenvolver, já que criei sem biblioteca.",
              "notification": "Notificação mostrando a situação do aplicativo e ícone personalizado para tal (importado pelo Android Studio).",
              "expoVersion": "Atualizei a versão do SDK do Expo para mais nova.",
              "designFigma": "Design único no Figma.",
              "adMob": "Publicidade do AdMob.",
              "localStorage": "O tema escolhido, se pode alertar no final do cronômetro e o histórico de sons, são salvos no cache do aplicativo (local storage)."
            }
          },
          "Ebooks": {
            "title": "E-books",
            "about": "Site de pesquisa de livros, que foi para o teste do processo seletivo que acabei sendo contratado na SGBr® Sistemas.",
            "challengesList": [
              "Desenvolvi o projeto em 1 semana e alguns dias.",
              "Tive que aprender as tecnologias: Vue, Pinia e Tailwind nesse mesmo tempo.",
              "Utilizado Pinia para o estado global.",
              "Tratamento de dados e validações quando for pesquisar o livro no caso de erro ou sucesso.",
              "Utilizei a API do Google para a pesquisa dos livros.",
              "Testei acessibilidade.",
              "Design único no Figma.",
              "Favoritos por local storage.",
              "Cada livro pode ser favorito ou removido pelo botão no cartão, tanto na aba de favorito e página principal.",
              "Imagens dos cartões podem ser clicadas e assim mostrando ela em tamanho maior.",
              "Site responsivo, pode ser usado em dispositivos móveis e computadores.",
              "Tratamento de textos dos cartões dos livros."
            ]
          },
          "Portfolio": {
            "title": "Portfólio",
            "about": "Minha página pessoal, onde é a vitrine sobre minha carreira, foi desenvolvida e ainda recebe atualizações para transmitir segurança para quem quer me contratar.",
            "challengesList": [
              "Design único no Figma.",
              "Site responsivo, pode ser usado em dispositivos móveis e computadores.",
              "Testei acessibilidade.",
              "Links do cabeçalho são indicados por uma troca de cor, conforme a seção em que você está situado.",
              "Funcionalidade da seção de conquistas, onde você clica em uma conquista e abre de um jeito no computador e outro no celular, também podendo ver a imagem da conquista em tamanho maior e o botão de mais detalhes.",
              "Página da política de privacidade sobre o aplicativo Media Timer.",
              "Todos os textos são pensados para contar sobre a minha experiência e trazer uma segurança ao cliente ou recrutador.",
              "Site em inglês/US e português/BR (depende do idioma do seu dispositivo) com i18next.",
              "Após clicar no botão do LinkedIn na seção de contato, acaba levando para a tela de “obrigado” que redireciona para o LinkedIn."
            ]
          },
          "GodOfWar": {
            "title": "God Of War E-commerce",
            "about": "Projeto fictício de e-commerce com a temática do jogo God of War: Ragnarök.",
            "challengesList": [
              "Design único no Figma.",
              "Carrossel de itens sem biblioteca, desenvolvido do zero e responsivo.",
              "Site responsivo, pode ser usado em dispositivos móveis e computadores.",
              "Carrinho e produtos por local storage.",
              "Testei acessibilidade.",
              "Tela fictícia de carrinho com os produtos que você escolheu.",
              "Cabeçalho se esconde rolando para baixo e rolando para cima se expande.",
              "Usando Context do React para o estado global."
            ]
          }
        }
      },
      "achievementsSection": {
        "title": "Conquistas",
        "buttonToCloseAlt": "Botão de fechar o modal",
        "cardExpandClickAria": "Clique para expandir ou fechar o cartão abaixo",
        "fingerToExpand": "Dedo clicável que expande o “sobre” da conquista",
        "clickToZoomAria": "Clique para abrir a imagem em tela cheia",
        "fingerToZoom": "Dedo clicável que abre a imagem em tela cheia",
        "moreDetails": "Mais detalhes",
        "achievements": {
          "RSTIFrontEnd": {
            "title": "Trilha Front-end RSTI",
            "about": "Curso presencial do Senac que ajudou a aperfeiçoar os conceitos de design, semântica de HTML e estilização CSS.",
            "imageAlt": "Imagem do certificado da trilha front-end RSTI do Senac."
          },
          "StartupWeekend": {
            "title": "Startup Weekend Smart Cities - Santo Ângelo/RS (2022)",
            "about": "Atuei como designer do aplicativo “O Campo”, vencedor dessa edição.",
            "imageAlt": "Imagem com o troféu de primeiro lugar do Smart Cities."
          },
          "RSTIProgrammingLogic": {
            "title": "Trilha Lógica de Programação RSTI",
            "about": "Curso presencial realizado no Senac, em que enfrentei desafios no papel e no computador. Como resultado, aperfeiçoei minha lógica com a programação.",
            "imageAlt": "Imagem do certificado da trilha lógica de programação RSTI do Senac"
          },
          "UdemyWebDesign": {
            "title": "Curso Web Design Udemy",
            "about": "Aprendi a desenvolver sites utilizando HTML, CSS e JavaScript. Com um toque especial de semântica, acessibilidade e lógica de programação.",
            "imageAlt": "Imagem do certificado do curso de Web Design da Udemy"
          },
          "UdemyProgrammingLogic": {
            "title": "Curso Algoritmos e Lógica de Programação Udemy",
            "about": "Nesse curso, foram apresentados exercícios e explicações sobre a lógica de programação. No fim, foram fundamentais para meu desenvolvimento.",
            "imageAlt": "Imagem do certificado do curso algoritmos e lógica de programação da Udemy"
          }
        }
      },
      "experiencesSection": {
        "title": "Experiências",
        "experiencesList": {
          "SGBrSistemas": {
            "position": "Desenvolvedor Front-end",
            "timeCompany": "Julho/2023 - Presente",
            "about": "Empresa onde trabalho no time de front-end e que criamos o novo sistema SG Master Web.",
            "challengesList": {
              "landingPage": "Criação e manutenção da Landing Page do sistema Web.",
              "developmentWebSystem": "Desenvolvimento e manutenção do novo sistema SG Master Web.",
              "undoChanges": "Correção de páginas com o botão de desfazer alterações (sendo ele, um botão que aparece na barra de ações que volta os valores do formulário ao estado inicial, seja edição ou cadastro).",
              "usersPermissions": "Implementação das novas permissões do usuário. Onde tive que desenvolver duas páginas de formulário, sendo para perfis e outra para usuários. Também troquei todas as permissões do sistema para as novas, criei e dei manutenção no componente de permissões e desenvolvi para funcionar junto ao botão de desfazer alterações.",
              "togetherBackend": "Trabalho conjunto com o time de back-end, repassando erros e mudanças necessárias do projeto.",
              "newFilters": "Implementação dos novos filtros V2 do back-end para selects do modelo antigo e modelo novo no front-end.",
              "refactoringPages": "Refatoração de páginas do modelo antigo para o modelo novo.",
              "components": "Desenvolvimento de componentes e arquivos de utilidades reutilizáveis.",
              "customizationQuasar": "Customizações de selects, inputs e outros componentes do Quasar por arquivo CSS, deixando o design diferente do padrão do framework. Para ser feita essas mudanças, tive que usar bastante o inspecionador do DevTools.",
              "taxDocuments": "Implementação de margens e envio de e-mail de documentos fiscais, junto ao time de back-end. Além disso, em cada módulo e nas configurações do envio de e-mail, pode-se alterar a mensagem do rodapé enviado no e-mail em um editor WYSIWYG."
            }
          },
          "HenriqueMascarin": {
            "position": "Fundador e Desenvolvedor Mobile",
            "timeCompany": "Agosto/2024 - Dezembro/2024",
            "about": "Minha empresa na Google Play, onde sou responsável pelo processo de desenvolvimento de aplicativos e questões sobre a minha marca.",
            "challengesList": {
              "buildBrand": "Construir minha marca na Google Play e cuidar do marketing sobre os aplicativos no LinkedIn da empresa.",
              "mediaTimer": "Desenvolver do zero, publicar e dar manutenção em produção sobre o aplicativo Media Timer na Google Play.",
              "adMob": "Tive que aprender sobre AdMob, para colocar anúncios nos aplicativos.",
              "licenses": "Licenças de projetos, para não haver cópias.",
              "issuesProjects": "Cuidar da política de privacidade e outras questões da Google em relação aos projetos."
            }
          }
        }
      },
      "contactSection": {
        "title": "Contato",
        "thanksMessage": "Obrigado por visitar meu portfólio!",
        "connectMessage": "Se sinta à vontade para se conectar e enviar uma mensagem pelo"
      }
    },
    "thanksPage": {
      "title": "Muito obrigado!",
      "replyText": "Lhe responderei quanto antes.",
      "caseOfRedirect": "Caso não seja redirecionado",
      "clickHere": "clique aqui!"
    },
    "policyMediaTimer": {
      "title": "Política de Privacidade",
      "welcome": {
        "title": "Bem vindo ao Media Timer, um aplicativo para android!",
        "subtitle": "Esse é um aplicativo temporizador desenvolvido por Henrique de Albuquerque Mascarin e visa resolver um problema pessoal."
      },
      "dataCollected": {
        "title": "Dados coletados pelo aplicativo",
        "declaration": "Nenhum dado é coletado. Tudo fornecido como dados de arquivos, histórico de áudios e configurações de tema são todos mantidos no aplicativo.",
        "permissionsParagraph": "A lista de permissões listadas abaixo são encontradas aqui no"
      },
      "permissionsList": {
        "permission": "Permissão",
        "necessary": "Porque é necessária",
        "reasons": {
          "adReason": "Utilizados para mostrar o anúncio de baixo na tela principal.",
          "storageReason": "Utilizados para ler áudios que a pessoa seleciona do seu dispositivo ou que estão salvos no histórico.",
          "notificationsReason": "Utilizado para mostrar as notificações do aplicativo, quando está executando o temporizador.",
          "historyArchiveReason": "Utilizado para encontrar o local do arquivo selecionado na aba de histórico.",
          "configureAudioReason": "Utilizado com a tecnologia EXPO AV, para configurar os áudios usados no aplicativo."
        },
        "contact": "Caso tenha visto alguma permissão que não esteja listada aqui ou sobre qualquer dúvida de segurança, se sinta livre em mandar uma mensagem ao e-mail:"
      }
    }
  }
}
