{
  "translation": {
    "mainPage": {
      "header": {
        "Info": "Sobre",
        "Technologies": "Tecnologias",
        "Projects": "Projetos",
        "Achievements": "Conquistas",
        "Experiences": "Experiências",
        "Contact": "Contato"
      },
      "nameSection": {
        "title": ["Henrique", "Mascarin", "Desenvolvedor", "Mobile"],
        "arrowDown": "Seta para ir na seção abaixo"
      },
      "infoSection": {
        "altPhoto": "Foto de Henrique",
        "title": "Sobre",
        "paragraphs": [
          "Sou uma pessoa determinada, que tenho como objetivo melhorar constantemente. Não gosto de brigas e tento sempre ser amigável. Procuro, assim, aprender com os outros e auxiliar o possível.",
          "Desenvolvedor a mais de 2 anos. Como desenvolvedor Mobile tenho experiência em React Native, TypeScript e Expo. No Front-end utilizo React, Vue e TypeScript.",
          "Atuando em projetos com centenas de clientes como o sistema SG Master Web, e desenvolvendo minha própria empresa na Google Play do zero até a publicação do aplicativo Media Timer.",
          "Nesses projetos visei dar um toque de design de interface tendo objetivo em ser agradável e chamativo, pensando na experiência do usuário.",
          "Atualmente, estou dedicando meu tempo na área de desenvolvimento Mobile com React Native. Visando aprimorar minhas habilidades e buscar novas oportunidades profissionais."
        ],
        "curriculum": "Currículo"
      },
      "technologiesSection": {
        "title": "Tecnologias"
      },
      "projectsSection": {
        "title": "Projetos",
        "policy": "Política de privacidade",
        "projects": {
          "MediaTimer": {
            "title": "Aplicativo de temporizador, teve como objetivo solucionar um problema pessoal.",
            "challengesList": [
              "Publicação na Google Play",
              "Licença para o projeto junto a termos de privacidade",
              "Poder escolher sons do celular, sons no aplicativo e historio de sons do celular",
              "Minha marca na Google Play, Linkedln e publicar sobre o projeto no Linkedln da empresa",
              "Aplicativo em Inglês/US e Português/BR (depende do idioma do seu dispositivo) com i18next",
              "Temas escuro e branco por Context do React",
              "Pelo codigo nativo, não permiti celulares (exemplo xiaomi) trocarem as cores dos temas por outras",
              "Estados globais pelo Redux",
              "Funciona em segundo plano",
              "Permissões do dispositivo",
              "Testar acessibilidade",
              "Logica do temporizador foi complexa de fazer",
              "Notificação mostrando status do aplicativo",
              "Atualizei versão do SDK do Expo para mais nova",
              "Pode desabilitar o som do alarme",
              "Design desenvolvido no Figma",
              "Anuncio do AdMoB"
            ]
          },
          "E-books": {
            "title": "Site de pesquisa de livros, foi um teste para o processo seletivo na área que acabei sendo contratado",
            "info": "Desenvolvi o projeto em 1 semana e alguns dias, também tive que aprender as tecnologias: Vue, Pinia e Tailwind. Tive desafios como: tratamento de dados na pesquisa da API no caso de erro ou sucesso, design no Figma, favoritos por localStorage.",
            "listInfo": ["Pode escolher sons do celular e sons no aplicativo"]
          }
        }
      }
    }
  }
}
