{
  "translation": {
    "mainPage": {
      "header": {
        "Info": "Sobre",
        "Technologies": "Tecnologias",
        "Projects": "Projetos",
        "Achievements": "Conquistas",
        "Experiences": "Experiências",
        "Contact": "Contato"
      },
      "nameSection": {
        "title": ["Henrique", "Mascarin", "Desenvolvedor", "Mobile"],
        "arrowDown": "Seta para ir na seção abaixo"
      },
      "infoSection": {
        "altPhoto": "Foto de Henrique",
        "title": "Sobre",
        "paragraphs": [
          "Sou uma pessoa determinada, que tenho como objetivo melhorar constantemente. Não gosto de brigas e tento sempre ser amigável. Procuro, assim, aprender com os outros e auxiliar o possível.",
          "Desenvolvedor a mais de 2 anos. Como desenvolvedor Mobile tenho experiência em React Native, TypeScript e Expo. No Front-end utilizo React, Vue e TypeScript.",
          "Atuando em projetos com centenas de clientes como o sistema SG Master Web, e desenvolvendo minha própria empresa na Google Play do zero até a publicação do aplicativo Media Timer.",
          "Nesses projetos visei dar um toque de design de interface tendo objetivo em ser agradável e chamativo, pensando na experiência do usuário.",
          "Atualmente, estou dedicando meu tempo na área de desenvolvimento Mobile com React Native. Visando aprimorar minhas habilidades e buscar novas oportunidades profissionais."
        ],
        "curriculum": "Currículo"
      },
      "technologiesSection": {
        "title": "Tecnologias"
      },
      "projectsSection": {
        "title": "Projetos",
        "policy": "Política de privacidade",
        "projects": {
          "StarTShirts": {
            "name": "Star T-Shirts",
            "title": "",
            "challengesList": [
              "Design unico no Figma"
            ]
          },
          "MediaTimer": {
            "name": "Media Timer",
            "title": "Aplicativo de temporizador, teve como objetivo solucionar um problema pessoal.",
            "challengesList": [
              "Projeto com mais de 1 ano de desenvolvimento",
              "Publicação na Google Play",
              "Licença para o projeto junto a termos de privacidade",
              "Poder escolher sons do celular, sons no aplicativo e historio de sons do celular",
              "Minha marca na Google Play, Linkedln e publicar sobre o projeto no Linkedln da empresa",
              "Aplicativo em Inglês/US e Português/BR (depende do idioma do seu dispositivo) com i18next",
              "Temas escuro e branco por Context do React",
              "Pelo codigo nativo, não permiti celulares (exemplo xiaomi) trocarem as cores dos temas por outras",
              "Estados globais pelo Redux",
              "Funciona em segundo plano",
              "Permissões do dispositivo",
              "Testar acessibilidade",
              "Logica do temporizador foi complexa de fazer",
              "Notificação mostrando status do aplicativo e icone personalizado para tal (importado pelo Android Studio)",
              "Atualizei versão do SDK do Expo para mais nova",
              "Pode desabilitar o som do alarme",
              "Design desenvolvido no Figma",
              "Anuncio do AdMoB"
            ]
          },
          "Ebooks": {
            "name": "E-books",
            "title": "Site de pesquisa de livros, foi um teste para o processo seletivo que acabei sendo contratado",
            "challengesList": [
              "Desenvolvi o projeto em 1 semana e alguns dias",
              "Tive que aprender as tecnologias: Vue, Pinia e Tailwind nessa semana",
              "Utilizado Pinia para o estado global",
              "Tratamento de dados na pesquisa da API no caso de erro ou sucesso",
              "Design unico no Figma",
              "Favoritos por localStorage",
              "Cada livro pode ser favoritado ou removido, pelo botão no cartao tanto na aba de favorito ou na principal",
              "Imagens dos cards podem sem clicados e assim mostra a imagem maior",
              "Site responsivo, podendo ser usado no celular e computador",
              "Tratamento de textos no design dos cartoes dos livros"
            ]
          },
          "GodOfWar": {
            "name": "God Of War E-commerce",
            "title": "Projeto fictício de e-commerce com a temática do jogo God of War: Ragnarök.",
            "challengesList": [
              "Design unico no Figma",
              "Carrousel de items sem biblioteca, criado na mão e responsivo",
              "Site responsivo, podendo ser usado no celular e computador",
              "Carrinho e produtos por localStorage",
              "Tela ficticia de carrinho com os produtos que você escolheu",
              "Cabeçalho se esconde quando rola pra baixo e quando rola a cima se expande",
              "Utilizado Context do React para o estado global"
            ]
          },
          "Portfolio": {
            "name": "Portfólio",
            "title": "",
            "challengesList": [
              "Design unico no Figma"
            ]
          }
        }
      }
    }
  }
}
