{
  "translation": {
    "mainPage": {
      "header": {
        "info": "Sobre",
        "technologies": "Tecnologias",
        "projects": "Projetos",
        "achievements": "Conquistas",
        "experiences": "Experiências",
        "contact": "Contato"
      },
      "nameSection": {
        "title": ["Henrique", "Mascarin", "Desenvolvedor", "Mobile"],
        "arrowDown": "Seta para ir na seção abaixo"
      },
      "infoSection": {
        "altPhoto": "Foto de Henrique",
        "title": "Sobre",
        "paragraphs": [
          "Sou uma pessoa determinada, que tenho como objetivo melhorar constantemente. Não gosto de brigas e tento sempre ser amigável. Procuro, assim, aprender com os outros e auxiliar o possível.",
          "Desenvolvedor a mais de 2 anos. Como desenvolvedor Mobile tenho experiência em React Native, TypeScript e Expo. No Front-end utilizo React, Vue e TypeScript.",
          "Atuando em projetos com centenas de clientes como o sistema SG Master Web, e desenvolvendo minha própria empresa na Google Play do zero até a publicação do aplicativo Media Timer.",
          "Nesses projetos visei dar um toque de design de interface tendo objetivo em ser agradável e chamativo, pensando na experiência do usuário.",
          "Atualmente, estou dedicando meu tempo na área de desenvolvimento Mobile com React Native. Visando aprimorar minhas habilidades e buscar novas oportunidades profissionais."
        ],
        "curriculum": "Currículo"
      },
      "technologiesSection": {
        "title": "Tecnologias"
      },
      "projectsSection": {
        "title": "Projetos",
        "policy": "Política de privacidade",
        "completed": "Concluido",
        "inProgress": "Em andamento",
        "projects": {
          "StarTShirts": {
            "name": "Star T-Shirts",
            "title": "Aplicativo fictício de e-commerce, somente de camisetas.",
            "challengesList": [
              "Design unico no Figma",
              "Primeiro projeto sem Expo, somente React Native CLI",
              "Módulo nativo para mostrar a Splash Screen, escrito com Kotlin",
              "React Navigation para rotas",
              "Estrutura do projeto foi pensada como se fosse um produto real",
              "Telas de formulário com React Hook Form, com suas validações do Zod",
              "Componentização de elementos que são muito utilizados",
              "Alertas geráveis por meio de estado global, para indicar certo estado"
            ]
          },
          "MediaTimer": {
            "name": "Media Timer",
            "title": "Aplicativo de temporizador, teve como objetivo solucionar um problema pessoal.",
            "challengesList": [
              "Projeto com mais de 1 ano de desenvolvimento",
              "Publicação na Google Play",
              "Licença para o projeto junto a termos de privacidade",
              "Poder escolher sons do celular, sons no aplicativo e historio de sons do celular",
              "Minha marca na Google Play, Linkedln e publicar sobre o projeto no Linkedln da empresa",
              "Aplicativo em Inglês/US e Português/BR (depende do idioma do seu dispositivo) com i18next",
              "Temas escuro e branco por Context do React",
              "Pelo codigo nativo, não permiti celulares (exemplo xiaomi) trocarem as cores dos temas por outras",
              "Estados globais pelo Redux",
              "Funciona em segundo plano",
              "Permissões do dispositivo",
              "Testar acessibilidade",
              "Logica do temporizador foi complexa de fazer",
              "Notificação mostrando status do aplicativo e icone personalizado para tal (importado pelo Android Studio)",
              "Atualizei versão do SDK do Expo para mais nova",
              "Pode desabilitar o som do alarme",
              "Design desenvolvido no Figma",
              "Anuncio do AdMoB",
              "Dados como o tema escolhido ou se é pra alertar no fim do timer, salvos no cache do aplicativo"
            ]
          },
          "Ebooks": {
            "name": "E-books",
            "title": "Site de pesquisa de livros, foi um teste para o processo seletivo que acabei sendo contratado",
            "challengesList": [
              "Desenvolvi o projeto em 1 semana e alguns dias",
              "Tive que aprender as tecnologias: Vue, Pinia e Tailwind nessa semana",
              "Utilizado Pinia para o estado global",
              "Tratamento de dados na pesquisa da API no caso de erro ou sucesso",
              "Testar acessibilidade",
              "Design unico no Figma",
              "Favoritos por localStorage",
              "Cada livro pode ser favoritado ou removido, pelo botão no cartao tanto na aba de favorito ou na principal",
              "Imagens dos cards podem sem clicados e assim mostra a imagem maior",
              "Site responsivo, podendo ser usado no celular e computador",
              "Tratamento de textos no design dos cartoes dos livros"
            ]
          },
          "Portfolio": {
            "name": "Portfólio",
            "title": "Landing Page desenvolvida com o objetivo de contar sobre minha expêriencia.",
            "challengesList": [
              "Design unico no Figma e diferentes designs para as seções do projeto",
              "Site responsivo, podendo ser usado no celular e computador",
              "Testar acessibilidade",
              "Links do cabecalho são indicados por uma troca de cor de acordo com a seção que você está situado",
              "Funcionalidade da seção de conquistas, aonde você clica em uma conquista e abre de jeito diferente no computador ou celular, também podendo dar zoom na imagem da conquista e ver mais detalhes",
              "Pagina de politica de privacidade de aplicativos",
              "Textos do site que foram pensados para contar sobre a minha expêriencia",
              "Site em Inglês/US e Português/BR (depende do idioma do seu dispositivo) com i18next",
              "Após clicar no icone do Linkedln na seção de contato, leva para a tela de obrigado que redireciona para o Linkedln"
            ]
          },
          "GodOfWar": {
            "name": "God Of War E-commerce",
            "title": "Projeto fictício de e-commerce com a temática do jogo God of War: Ragnarök.",
            "challengesList": [
              "Design unico no Figma",
              "Carrousel de items sem biblioteca, criado na mão e responsivo",
              "Site responsivo, podendo ser usado no celular e computador",
              "Carrinho e produtos por localStorage",
              "Testar acessibilidade",
              "Tela ficticia de carrinho com os produtos que você escolheu",
              "Cabeçalho se esconde quando rola pra baixo e quando rola a cima se expande",
              "Utilizado Context do React para o estado global"
            ]
          }
        }
      },
      "achievementsSection": {
        "title": "Conquistas",
        "buttonToCloseAlt": "Botão de fechar o modal",
        "cardExpandClickAria": "Clique para expandir ou fechar o cartão abaixo",
        "fingerToExpand": "Dedo clicável que expande o sobre da conquista",
        "clickToZoomAria": "Clique para abrir a imagem em tela cheia",
        "fingerToZoom": "Dedo clicável que abre a imagem em tela cheia",
        "moreDetails": "Mais detalhes",
        "achievements": {
          "RSTIFrontEnd": {
            "title": "Trilha Front-end RSTI",
            "about": "Curso presencial do Senac que ajudou a aperfeiçoar os conceitos de design, semântica de HTML e estilização CSS.",
            "imageAlt": "Imagem de certificado da trilha front-end RSTI do Senac."
          },
          "startupWeekend": {
            "title": "Startup Weekend Smart Cities - Santo Ângelo/RS (2022)",
            "about": "Atuei como designer do aplicativo “O Campo”, vencedor dessa edição.",
            "imageAlt": "Imagem com o troféu de primeiro lugar do Smart Cities."
          },
          "RSTIProgrammingLogic":{
            "title": "Trilha Lógica de Programação RSTI",
            "about": "Curso presencial realizado no Senac, que enfrentei desafios no papel e computador. Como resultado, aperfeiçoaram minha lógica com a programação.",
            "imageAlt": "Imagem de certificado da trilha lógica de programação RSTI do Senac"
          },
          "UdemyWebDesign": {
            "title": "Curso Web Design",
            "about": "Tive como aprendizado o desenvolvimento de sites utilizando HTML, CSS e JavaScript. Com um toque especial de semântica, acessibilidade e lógica de programação.",
            "imageAlt": "Imagem de certificado do curso web design da Udemy"
          },
          "UdemyProgrammingLogic": {
            "title": "Curso Algoritmos e Lógica de Programação Udemy",
            "about":  "Nesse curso, foram apresentados exercícios e explicações sobre a lógica de programação. No fim, foram fundamentais para meu desenvolvimento.",
            "imageAlt": "Imagem de certificado do curso algoritmos e lógica de programação da Udemy"
          }
        }
      }

    }
  }
}
